import React from "react";
import HelpCard from "../HelpCard/HelpCard";
import pharmaLogin from "../../assets/pharma-login.png";

const HomeDetails = () => {
  return (
    <div>
      <h1 className="text-lg md:text-3xl font-semibold">Pharmacy Management Software</h1>
      <p className="text-xs mt-2 leading-5 w-full md:w-2/3">
        বাংলাদেশের খুঁচরা ঔষধ বিপনীগুলোর কাজ সহজসাধ্য করতে ঔষধ প্রশাসন
        অধিদপ্তরের সার্বিক তত্ত্বাবধানে ম্যানেজমেন্ট সায়েন্সেস ফর হেলথ - এর
        বেটার হেলথ ইন বাংলাদেশ (বিএইচবি) প্রকল্প তাদের জন্য একটি ফার্মেসি
        ম্যানেজমন্টে সফটওয়্যার তৈরি করেছে। সফটওয়্যারটি বিপনীগুলো বিনামূল্যেই
        ব্যবহার করতে পারবে
      </p>

      <div className="grid grid-cols-1 md:grid-cols-7 md:gap-2 lg:gap-x-12 gap-y-5 md:gap-y-0 mt-5 md:mt-7">
        <div className="col-span-5 p-4 border border-[#880015] rounded-md">
          <h2 className="text-base font-semibold">
            ফার্মেসি ম্যানেজমেন্ট সফটওয়্যার এর পরিচিতি
          </h2>
          <p className="text-xs mt-2 leading-5">
            বাংলাদেশের খুঁচরা ঔষধ বিপনীগুলোর কাজ সহজসাধ্য করতে ঔষধ প্রশাসন
            অধিদপ্তরের সার্বিক তত্ত্বাবধানে ম্যানেজমেন্ট সায়েন্সেস ফর হেলথ - এর
            বেটার হেলথ ইন বাংলাদেশ (বিএইচবি) প্রকল্প তাদের জন্য একটি ফার্মেসি
            ম্যানেজমন্টে সফটওয়্যার তৈরি করেছে। সফটওয়্যারটি বিপনীগুলো বিনামূল্যেই
            ব্যবহার করতে পারবে। এই সফটওয়্যারটি ব্যবহারের মাধ্যমে প্রতিটি ঔষধের
            বিক্রয়ের পরিমাণ, এগুলোর মধ্যে প্রেসক্রিপশনসহ এবং প্রেসক্রিপশনবিহীন
            বিক্রিযোগ্য ঔষধের তালিকা ও অনুপাত, বিশ্বস্বাস্থ্য সংস্থার AWaRe
            (Access, Watch, Reserve) শ্রেণীবিন্যাস অনুযায়ী কোন ধরণের
            এন্টিবায়োটিকস কি পরিমাণ বিক্রি হয়েছে এ রকম নানা ধরণের তথ্য বিশ্লেষন
            করা সম্ভব হবে। বিপনীগুলো মেয়াদোত্তীর্ণ ঔষধ চিহ্নিত করতে পারবে এবং
            যথাসময়ে সেগুলো সঠিক পদ্ধতিতে সরিয়ে ফেলতে পারবে। তারা দৈনন্দিন, মাসিক
            ও বার্ষিক ক্রয়-বিক্রয় এবং লাভ-লোকসানের হিসাব জানতে পারবে। বিএইচবি এই
            সফটওয়্যার বিষয়ে খুঁচরা ঔষধ বিপনীগুলোর ব্যবহারকারীদের সাথে নিয়মিত
            যোগাযোগ করে থাকে। তাদের মতামতের উপর ভিত্তি করেই সফটওয়্যারটি উন্নয়ন
            করা হয়েছে। ২০২৩ সালের সেপ্টেম্বর মাস থেকে একটি তথ্য প্রযুক্তি
            প্রতিষ্ঠান এই উন্নয়নের কাজটি করছে। এখন সফটওয়্যারটির প্রতিটি
            ইন্টারফেসই খুব সাবলীলভাবে দ্রুততার সাথে কাজ করে। রিপোর্টিং
            ড্যাশবোর্ডটিতে বিস্তৃত তথ্যের সমাহার ঘটানো হয়েছে এবং সহজবোধ্য উপায়ে
            বিপনী পরিচালনার পদ্ধতি বর্ণিত হয়েছে। ইতোমধ্যে এই সফটওয়্যারটি এখন
            উন্নত এবং নুতনভাবে অনলাইনে ব্যবহারকারীদের জন্য দেয়া হয়েছে।
            সফটওয়্যারটি সম্পর্কে আপনার যে কোন মূল্যবান মতামত আমাদেরকে
            pms@betterhealth-bd.org ইমেইলে জানান
          </p>
        </div>
        {/* contact info  */}
        <div className="col-span-2 border border-[#880015] rounded-md p-4">
          <HelpCard display="block !space-y-4" />
          <div className="flex items-center justify-center gap-3 mt-9">
            <img className="w-10 h-8" src={pharmaLogin} alt="" />
            <p className="text-lg font-semibold">
              <span className="text-[#006E9E]">Pharma</span> DRA Solution
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default HomeDetails;
